app/Controllers/AsdosController.php

SELECT *
FROM `matkul`
---
    public function index()
    {
        $model = new Matkul();
        $data ['matkul']= $model->findAll();

INSERT INTO `matkul` (`matkul`, `sks`) VALUES ('Desain Web Praktik', '3')
---
    public function save()
    {
        $model = new Matkul();
        $data = [
            'matkul' => $this->request->getPost('matkul'),
            'sks' => $this->request->getPost('sks')
        ];
        $model->insert($data);

SELECT *
FROM `matkul`
WHERE `matkul`.`id_matkul` = '4'
---
    public function edit($id_matkul)
    {
        $model = new Matkul();
        $data['matkul'] = $model->find($id_matkul);

DELETE FROM `matkul`
WHERE `id_matkul` IN ('6')
---
    public function delete($id_matkul)
    {
        $model = new Matkul();
        $model->delete($id_matkul);